# https://github.com/Homebrew/homebrew-bundle
# specify a directory to install
cask_args appdir: '/Applications'
tap 'homebrew/cask' || true
tap 'homebrew/cask-fonts' || true
tap 'homebrew/cask-versions' || true

# install packages
brew 'asdf'
brew 'bat'
brew 'dust'
brew 'exa'
brew 'fzf'
brew 'gawk'
brew 'git'
brew 'git-delta'
brew 'gpg'
brew 'jq'
brew 'mas'
brew 'rcm'
brew 'starship'
brew 'the_silver_searcher'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'zoxide'
brew 'watchman'

# Casks
cask 'alacritty'
cask 'android-studio'
cask 'firefox'
cask 'flutter'
cask 'font-fira-mono-nerd-font'
cask 'google-chrome'
cask 'slack'
cask 'visual-studio-code'
cask 'vlc'

# AppStore

mas "XCode", id: 497799835
