# https://github.com/Homebrew/homebrew-bundle
# specify a directory to install
cask_args appdir: '/Applications'
tap 'homebrew/cask' || true
tap 'homebrew/cask-fonts' || true
tap 'homebrew/cask-versions' || true
tap 'microsoft/git' || true

# install packages
brew 'asdf'
brew 'bat'
brew 'bottom'
brew 'bundletool'
brew 'cargo-watch'
brew 'cocoapods'
brew 'dust'
brew 'exa'
brew 'fd'
brew 'fzf'
brew 'gawk'
brew 'git'
brew 'gitleaks'
brew 'git-delta'
brew 'gpg'
brew 'grex'
brew 'imagemagick'
brew 'jq'
brew 'mas'
brew 'procs'
brew 'rcm'
brew 'ripgrep'
brew 'sd'
# Dropped in favor of powerlevel 10k
#brew 'starship'
brew 'the_silver_searcher'
brew 'tldr'
brew 'tokei'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'zoxide'
brew 'watchman'

# Casks
# Being handled through Jetbrains Toolbox
#cask 'android-studio'
cask 'firefox'
cask 'flutter'
cask 'google-chrome'
cask 'iterm2'
cask 'slack'
cask 'visual-studio-code'
cask 'vlc'
cask 'git-credential-manager-core'

# AppStore
# Do not do this, install manually from developer portal, to avoid auto-updates
# mas "XCode", id: 497799835

# Fonts 
cask 'font-fira-mono-nerd-font'
cask 'font-fira-code'
cask 'font-iosevka'
cask 'font-iosevka-nerd-font'
