# https://github.com/Homebrew/homebrew-bundle
# specify a directory to install
cask_args appdir: "/Applications"
tap "homebrew/cask" || true
tap "homebrew/cask-fonts" || true
tap "homebrew/cask-versions" || true
tap "jesseduffield/lazygit" || true
tap "microsoft/git" || true
tap "ggozad/formulas" || true
tap "wix/brew" || true

# install packages
brew "ack"
brew "applesimutils"
brew "asdf"
brew "bash"
brew "bat"
brew "bottom"
brew "bundletool"
brew "cargo-watch"
# Cocoapods versioning is now handled through asdf
#brew "cocoapods"
brew "docker"
brew "docker-compose"
brew "dust"
brew "dua-cli"
brew "duf"
brew "exa"
brew "fd"
brew "fzf"
brew "gawk"
brew "ggozad/formulas/oterm"
brew "git"
brew "git-delta"
brew "git-gui"
brew "git-lfs"
brew "gitleaks"
brew "glow"
brew "gnu-sed"
brew "gnupg"
brew "grex"
brew "imagemagick"
brew "jesseduffield/lazygit/lazygit"
brew "jq"
brew "ltex-ls"
brew "marp-cli"
brew "mas"
brew "portaudio"
brew "pre-commit"
brew "procs"
brew "pstree"
brew "python-distlib"
brew "python-filelock"
brew "python-platformdirs"
brew "python-setuptools"
brew "pyyaml"
brew "rcm"
brew "reattach-to-user-namespace"
brew "ripgrep"
# Ruby versioning is now handled through asdf
#brew "ruby"
brew "scrcpy"
brew "sd"
# Dropped in favor of powerlevel 10k
#brew "starship"
brew "the_silver_searcher"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tokei"
brew "virtualenv"
brew "watchman"
cask "wget"
brew "yq"
brew "zoxide"

# Casks
# Being handled through Jetbrains Toolbox
#cask "android-studio"
cask "firefox"
cask "flutter"
cask "git-credential-manager-core"
cask "iterm2"
cask "neovide"
cask "slack"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "wezterm"

# AppStore
# Do not do this, install manually from developer portal, to avoid auto-updates
# mas "XCode", id: 497799835

# Fonts 
cask "font-fira-mono-nerd-font"
cask "font-fira-code"
cask "font-iosevka"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-twitter-color-emoji"
